models/Users.php

	public static function findIdentity($id)
    {
        return static::findOne($id);
---
SELECT * FROM `users` WHERE `id`=1

    public static function findByUsername($username)
    {
                return static::find()->where(['email' => $username])->one();
---
SELECT * FROM `users` WHERE `email`='admin@hrm.com'